<a href="https://colab.research.google.com/github/Geeta1999/PythonNotes/blob/main/pandas_practice.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
list_1 = [1, 2, 3, 4, 5, 6, 7, 8]

In [ ]:
type(list_1)

list

In [ ]:
series_1 = pd.Series(list_1)

In [ ]:
series_1

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
dtype: int64

In [ ]:
type(series_1)

pandas.core.series.Series

In [ ]:
series_2 = pd.Series(list_1, index=['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])

In [ ]:
print(series_2)

a    1
b    2
c    3
d    4
e    5
f    6
g    7
h    8
dtype: int64

In [ ]:
dict_1 = {
    'a': 1,
    'b': 2,
    'c': 3,
    'd': 4,
    'e': 5
}

In [ ]:
series_3 = pd.Series(dict_1)

In [ ]:
series_3

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [ ]:
series_1.shape

(8,)

In [ ]:
series_1.dtype

dtype('int64')

In [ ]:
series_1.index

RangeIndex(start=0, stop=8, step=1)

In [ ]:
series_1.to_list()

[1, 2, 3, 4, 5, 6, 7, 8]

In [ ]:
series_1

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
dtype: int64

In [ ]:
series_1[0:8:2]

0    1
2    3
4    5
6    7
dtype: int64

In [ ]:
series_2

a    1
b    2
c    3
d    4
e    5
f    6
g    7
h    8
dtype: int64

In [ ]:
series_2[0:7:2]

a    1
c    3
e    5
g    7
dtype: int64

In [ ]:
series_1[-4::2]

4    5
6    7
dtype: int64

In [ ]:
series_2.loc['a']

1

In [ ]:
series_2.loc['a':'e']

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [ ]:
series_2.iloc[0:7]

a    1
b    2
c    3
d    4
e    5
f    6
g    7
dtype: int64

In [ ]:
data_frame = pd.DataFrame([[1, 2, 3], [4, 5, 6], [7, 8, 9]])

In [ ]:
data_frame

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [ ]:
data_frame = pd.DataFrame([[1, 2, 3], [4, 5, 6], [7, 8, 9]],
                          columns=['A', 'B', 'C'], index=['a', 'b','c'])

In [ ]:
data_frame

   A  B  C
a  1  2  3
b  4  5  6
c  7  8  9

In [ ]:
dict_2 = {
    'A': [1, 2, 3],
    'B': [4, 5, 6],
    'C': [7, 8, 9]
}

In [ ]:
data_frame = pd.DataFrame(dict_2)

In [ ]:
data_frame

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [ ]:
data_frame = pd.read_csv('./insurance.csv')

In [ ]:
data_frame

      age     sex   bmi  children smoker     region  expenses
0      19  female  27.9         0    yes  southwest  16884.92
1      18    male  33.8         1     no  southeast   1725.55
2      28    male  33.0         3     no  southeast   4449.46
3      33    male  22.7         0     no  northwest  21984.47
4      32    male  28.9         0     no  northwest   3866.86
...   ...     ...   ...       ...    ...        ...       ...
1333   50    male  31.0         3     no  northwest  10600.55
1334   18  female  31.9         0     no  northeast   2205.98
1335   18  female  36.9         0     no  southeast   1629.83
1336   21  female  25.8         0     no  southwest   2007.95
1337   61  female  29.1         0    yes  northwest  29141.36

[1338 rows x 7 columns]

In [ ]:
data_frame.shape

(1338, 7)

In [ ]:
data_frame.dtypes

age           int64
sex          object
bmi         float64
children      int64
smoker       object
region       object
expenses    float64
dtype: object

In [ ]:
data_frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       1338 non-null   int64
 1   sex       1338 non-null   object
 2   bmi       1338 non-null   float64
 3   children  1338 non-null   int64
 4   smoker    1338 non-null   object
 5   region    1338 non-null   object
 6   expenses  1338 non-null   float64
dtypes: float64(2), int64(2), object(3)
memory usage: 73.3+ KB

In [ ]:
data_frame.iloc[0:5, :]

   age     sex   bmi  children smoker     region  expenses
0   19  female  27.9         0    yes  southwest  16884.92
1   18    male  33.8         1     no  southeast   1725.55
2   28    male  33.0         3     no  southeast   4449.46
3   33    male  22.7         0     no  northwest  21984.47
4   32    male  28.9         0     no  northwest   3866.86

In [ ]:
data_frame.iloc[:5, :3]

   age     sex   bmi
0   19  female  27.9
1   18    male  33.8
2   28    male  33.0
3   33    male  22.7
4   32    male  28.9

In [ ]:
data_frame.loc[:10, 'age':'smoker']

    age     sex   bmi  children smoker
0    19  female  27.9         0    yes
1    18    male  33.8         1     no
2    28    male  33.0         3     no
3    33    male  22.7         0     no
4    32    male  28.9         0     no
5    31  female  25.7         0     no
6    46  female  33.4         1     no
7    37  female  27.7         3     no
8    37    male  29.8         2     no
9    60  female  25.8         0     no
10   25    male  26.2         0     no

In [ ]:
data_frame.index

RangeIndex(start=0, stop=1338, step=1)

In [ ]:
data_frame.columns

Index(['age', 'sex', 'bmi', 'children', 'smoker', 'region', 'expenses'], dtype='object')

In [ ]:
data_frame[['age', 'sex', 'bmi']][0:10]

   age     sex   bmi
0   19  female  27.9
1   18    male  33.8
2   28    male  33.0
3   33    male  22.7
4   32    male  28.9
5   31  female  25.7
6   46  female  33.4
7   37  female  27.7
8   37    male  29.8
9   60  female  25.8